export const suggestedSurveyTitlesInitial = [
  "قياس الرضا عن الخدمات المدرسية",
  "تقييم فعالية الأنشطة اللاصفية",
  "تحليل الاحتياجات التدريبية للمعلمين",
  "استطلاع رأي حول جودة التواصل بين المدرسة وأولياء الأمور",
  "تقييم مستوى الأمان في البيئة المدرسية",
  "قياس مدى استفادة الطلاب من المصادر التعليمية الرقمية",
];

export const targetGroupOptions = [
  { id: 'students', label: 'الطلاب' },
  { id: 'teachers', label: 'المعلمون' },
  { id: 'parents', label: 'أولياء الأمور' },
  { id: 'admin_staff', label: 'الهيئة الإدارية' },
  { id: 'supervisors', label: 'المشرفون التربويون' },
];